<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest Pidgin with GTK exe. Permission was obtained from FossHub to automate the download of this software. Please follow their terms of service: https://www.fosshub.com/tos.html</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.PidginGTK-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Pidgin</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.rustymyers.SharedProcessors/FossHubURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>app_name</key>
                <string>Pidgin</string>
                <key>app_type</key>
                <string>Windows Installer (with GTK)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>CURL_PATH</key>
                <string>/usr/bin/curl</string>
                <key>url</key>
                <string>%url%</string>
                 <key>request_headers</key>
                    <dict>
                            <key>user-agent</key>
                            <string>%USER_AGENT%</string>
                    </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
